---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsFpSprinklerTemperatureRatingParam
source: html/c819a214-3a7f-c25e-fa9e-ce93a71ed5fc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsFpSprinklerTemperatureRatingParam Property

"Temperature Rating"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsFpSprinklerTemperatureRatingParam { get; }
```